#include<stdio.h>
void jiemian()
{
	printf("*************************************************\n"
	       "                       循环队列\n"
	       "--> 1、 初始化队列\n"
	       "--> 2、 销毁队列\n"
	       "--> 3、 检查队列是否已满\n"
	       "--> 4、 检查队列是否为空\n"
	       "--> 5、 查看队头元素\n"
	       "--> 6、 确定队列长度\n"
	       "--> 7、 入队操作\n"
	       "--> 8、 出队操作\n"
	       "--> 9、 清空队列\n"
	       "--> 10、遍历函数操作\n"
	       "--> 11、清屏\n"
	       "--> 0、 退出程序\n"
	       "**************************************************\n");
}

void typemenu()
{
	printf("\n现在请确认你要存储的数据类型：\n"
		"->1、整型\n"
		"->2、浮点型\n"
		"->3、字符型\n"
		"->4、字符串\n");
}
